{"articles": ["CUPERTINO — Apple Inc revealed on Tuesday that its streaming TV service will kick off Nov. 1 and cost $5.99 a month in Canada, as the tech giant reaches a turning point where it focuses as much on services as its hardware and software. Apple TV+ will be avai", "Apple Inc’s move to offer a free TV+ subscription for a year with every new device may briefly crown the iPhone maker as the biggest streaming service by user numbers, leapfrogging Netflix Inc. But it doesn’t mean Apple will keep the lead. Under the company", "SINGAPORE — “Uncertainty” was the buzzword at the crude oil industry’s annual gathering in Asia, but virtually everybody was reluctant to talk about the root cause behind the sector’s discomfort – U.S. President Donald Trump. Speaker after speaker at this we", "CALGARY – Enbridge Inc. is firing back at companies that have criticized its plans to revamp the operation of Canada’s largest oil export pipeline network. In a filing Wednesday with the Canadian Energy Regulator, Enbridge responded to a deluge of complaints"], "titles": ["Apple’s streaming TV service to cost $4.99 a month, launch Nov. 1", "Apple looks set to steal Netflix’s streaming crown — but its lead won’t last long", "'We need to talk about Donald' — The elephant in oil's uncertain world - Financial Post", "Enbridge urges regulator to avoid intervening in pipeline plan"], "urls": ["https://business.financialpost.com/technology/personal-tech/apple-to-reveal-streaming-service-prices-while-iphones-in-holding-pattern-until-5g", "https://business.financialpost.com/technology/personal-tech/apple-looks-set-to-steal-netflixs-streaming-crown-but-its-lead-wont-last-long", "https://business.financialpost.com/commodities/energy/we-need-to-talk-about-donald-the-elephant-in-crude-oils-uncertain-world-russell-2", "https://business.financialpost.com/commodities/enbridge-urges-regulator-to-avoid-intervening-in-pipeline-plan"], "imgurls": ["https://financialpostcom.files.wordpress.com/2019/09/cook.jpg", "https://financialpostcom.files.wordpress.com/2019/09/see.jpg", "https://financialpostcom.files.wordpress.com/2019/09/donald-trump2.jpg", "https://financialpostcom.files.wordpress.com/2019/09/aenbridge_agl_eco.jpg"]}